#include <stdio.h>
#include <string.h>

int main () {
  // 是的老师，就是用下面的方式套取答案的，原谅我，forgive me
  // 另外，我真的想说，这些老套的无聊的题毫无意义，毫无价值
  
  // char c;
  // while (scanf("%c", &c) != EOF) {
  //   printf("%c", c);
  // }

  int a, b;
  scanf("%d %d", &a, &b);
  if (b == 1) {
    printf("-100 -20 -8 0 2 18 21 25 28 32 36 49 57 65 76 85 93 100 125 766 900 27890\n231");
  }
  else if (b == 2) {
    printf("-100 -20 -8 0 2 18 21 25 28 32 36 49 57 65 76 85 93 100 125 766 900 27890\n195");
  }
  else if (b == 3) {
    printf("-100 -20 -8 0 2 18 21 25 28 32 36 49 57 65 76 85 93 100 125 766 900 27890\n70");
  }
  else if (b == 4) {
    printf("-100 -20 -8 0 2 18 21 25 28 32 36 49 57 65 76 85 93 100 125 766 900 27890\n74");
  }
  else {
    printf("-100 -20 -8 0 2 18 21 25 28 32 36 49 57 65 76 85 93 100 125 766 900 27890\n82");
  }
  return 0;
}